In [84]:
import numpy as np
import pandas as pd
import re

# Configuraci√≥n
# -----------------------------------------------------------------------
pd.set_option('display.max_columns', None) # para poder visualizar todas las columnas de los DataFrames

# Punto --> Exploraci√≥n de los datos! ‚úÖ

In [85]:
df = pd.read_csv('df_limpio.csv', index_col= 0)
df.head()

,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,roledepartament,remotework
unnamed: 0,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
0,51,No,NaN,684.0,NaN,6,3,NaN,"162,0",1,Male,51,3,5,research director,3,NaN,"19537,0",6462,7,No,13,"3,0",3,0,NaN,5,"3,0",20,NaN,15,15,"19537,0",1972,NaN,Yes
1,52,No,NaN,699.0,NaN,1,4,life sciences,"259,0",3,Male,65,2,5,manager,3,NaN,"19999,0",5678,0,NaN,14,"3,0",1,1,"34,0",5,"3,0",33,NaN,11,9,"19999,0",1971,NaN,1
2,42,No,travel rarely,532.0,research & development,4,2,technical degree,"319,0",3,Male,58,3,5,manager,4,Married,"19232,0",4933,1,No,11,"3,0",4,0,"22,0",3,NaN,22,NaN,11,15,"19232,0",1981,manager - research & development,1
3,47,No,travel rarely,359.0,NaN,2,4,medical,NaN,1,Female,82,3,4,research director,3,Married,"17169,0",26703,3,NaN,19,"3,0",2,2,NaN,2,NaN,20,NaN,5,6,"17169,0",1976,NaN,False
4,46,No,NaN,1319.0,NaN,3,3,technical degree,NaN,1,Female,45,4,4,sales executive,1,Divorced,NaN,7739,2,No,12,"3,0",4,1,NaN,5,"3,0",19,NaN,2,8,NaN,1977,NaN,0

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1614 entries, 0 to 1613
Data columns (total 36 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   age                       1614 non-null   int64
 1   attrition                 1614 non-null   object
 2   businesstravel            842 non-null    object
 3   dailyrate                 1490 non-null   float64
 4   department                302 non-null    object
 5   distancefromhome          1614 non-null   int64
 6   education                 1614 non-null   int64
 7   educationfield            869 non-null    object
 8   employeenumber            1183 non-null   object
 9   environmentsatisfaction   1614 non-null   int64
 10  gender                    1614 non-null   object
 11  hourlyrate                1614 non-null   object
 12  jobinvolvement            1614 non-null   int64
 13  joblevel                  1614 non-null   int64
 14  jobrole                   1614 non-null   object
 15  jobsatisfaction           1614 non-null   int64
 16  maritalstatus             963 non-null    object
 17  monthlyincome             771 non-null    object
 18  monthlyrate               1614 non-null   int64
 19  numcompaniesworked        1614 non-null   int64
 20  overtime                  938 non-null    object
 21  percentsalaryhike         1614 non-null   int64
 22  performancerating         1419 non-null   object
 23  relationshipsatisfaction  1614 non-null   int64
 24  stockoptionlevel          1614 non-null   int64
 25  totalworkingyears         1088 non-null   object
 26  trainingtimeslastyear     1614 non-null   int64
 27  worklifebalance           1506 non-null   object
 28  yearsatcompany            1614 non-null   int64
 29  yearsincurrentrole        34 non-null     object
 30  yearssincelastpromotion   1614 non-null   int64
 31  yearswithcurrmanager      1614 non-null   int64
 32  sameasmonthlyincome       771 non-null    object
 33  datebirth                 1614 non-null   int64
 34  roledepartament           302 non-null    object
 35  remotework                1614 non-null   object
dtypes: float64(1), int64(17), object(18)
memory usage: 466.5+ KB

In [20]:
df.columns

Index(['age', 'attrition', 'businesstravel', 'dailyrate', 'department',
       'distancefromhome', 'education', 'educationfield', 'employeenumber',
       'environmentsatisfaction', 'gender', 'hourlyrate', 'jobinvolvement',
       'joblevel', 'jobrole', 'jobsatisfaction', 'maritalstatus',
       'monthlyincome', 'monthlyrate', 'numcompaniesworked', 'overtime',
       'percentsalaryhike', 'performancerating', 'relationshipsatisfaction',
       'stockoptionlevel', 'totalworkingyears', 'trainingtimeslastyear',
       'worklifebalance', 'yearsatcompany', 'yearsincurrentrole',
       'yearssincelastpromotion', 'yearswithcurrmanager',
       'sameasmonthlyincome', 'datebirth', 'roledepartament', 'remotework'],
      dtype='object')

In [89]:
df.dtypes

age                           int64
attrition                    object
businesstravel               object
dailyrate                   float64
department                   object
distancefromhome              int64
education                     int64
educationfield               object
employeenumber               object
environmentsatisfaction       int64
gender                       object
hourlyrate                   object
jobinvolvement                int64
joblevel                      int64
jobrole                      object
jobsatisfaction               int64
maritalstatus                object
monthlyincome                object
monthlyrate                   int64
numcompaniesworked            int64
overtime                     object
percentsalaryhike             int64
performancerating            object
relationshipsatisfaction      int64
stockoptionlevel              int64
totalworkingyears            object
trainingtimeslastyear         int64
worklifebalance              object
yearsatcompany                int64
yearsincurrentrole           object
yearssincelastpromotion       int64
yearswithcurrmanager          int64
sameasmonthlyincome          object
datebirth                     int64
remotework                   object
dtype: object

## E) Porcentaje de valores nulos del total dataframe

In [7]:
df.isnull().sum()

age                            0
attrition                      0
businesstravel               772
dailyrate                    124
department                  1312
distancefromhome               0
education                      0
educationfield               745
employeenumber               431
environmentsatisfaction        0
gender                         0
hourlyrate                     0
jobinvolvement                 0
joblevel                       0
jobrole                        0
jobsatisfaction                0
maritalstatus                651
monthlyincome                843
monthlyrate                    0
numcompaniesworked             0
overtime                     676
percentsalaryhike              0
performancerating            195
relationshipsatisfaction       0
stockoptionlevel               0
totalworkingyears            526
trainingtimeslastyear          0
worklifebalance              108
yearsatcompany                 0
yearsincurrentrole          1580
yearssincelastpromotion        0
yearswithcurrmanager           0
sameasmonthlyincome          843
datebirth                      0
roledepartament             1312
remotework                     0
dtype: int64

In [22]:
porcentaje_nulos = df.isnull().mean() * 100

# df.isnull().sum()/registro[0] - Otra forma de hacerlo

# Muestra los resultados<z
porcentaje_nulos

age                          0.000000
attrition                    0.000000
businesstravel              47.831475
dailyrate                    7.682776
department                  81.288724
distancefromhome             0.000000
education                    0.000000
educationfield              46.158612
employeenumber              26.703841
environmentsatisfaction      0.000000
gender                       0.000000
hourlyrate                   0.000000
jobinvolvement               0.000000
joblevel                     0.000000
jobrole                      0.000000
jobsatisfaction              0.000000
maritalstatus               40.334572
monthlyincome               52.230483
monthlyrate                  0.000000
numcompaniesworked           0.000000
overtime                    41.883519
percentsalaryhike            0.000000
performancerating           12.081784
relationshipsatisfaction     0.000000
stockoptionlevel             0.000000
totalworkingyears           32.589839
trainingtimeslastyear        0.000000
worklifebalance              6.691450
yearsatcompany               0.000000
yearsincurrentrole          97.893432
yearssincelastpromotion      0.000000
yearswithcurrmanager         0.000000
sameasmonthlyincome         52.230483
datebirth                    0.000000
roledepartament             81.288724
remotework                   0.000000
dtype: float64

In [23]:
registro = df.shape
registro

(1614, 36)

# Punto --> Revisi√≥n de cada columna

In [ ]:
 
'Age' # OK
'Attrition' # OK
'BusinessTravel' # revisar los NAN, Eliminarlos
'DailyRate' # OK
'Department' # revisar los NAN, Eliminarlos
'DistanceFromHome' # OK
'Education' # OK
'EducationField' # Revisar los NAN
'employeecount' # Ok - ELIMINDADO
'employeenumber' # duplicados

'EnvironmentSatisfaction' # Ok 
'Gender' # # OK
'HourlyRate' # OK
'JobInvolvement' # OK
'JobLevel' # OK
'JobRole' # OK
'JobSatisfaction' # OK
'MaritalStatus' # revisar los NAN
'MonthlyIncome' # revisar los NAN
'MonthlyRate' # OK

'NUMCOMPANIESWORKED' # OK
'Over18' # ELIMINADO
'OverTime' # revisar los NAN
'PercentSalaryHike' # OK
'PerformanceRating' # revisar los NAN
'RelationshipSatisfaction' # OK
'StandardHours' # ELIMINADO
'StockOptionLevel' # OK
'TOTALWORKINGYEARS' # revisar los NAN
'TrainingTimesLastYear' # OK

'WORKLIFEBALANCE' # revisar los NAN
'YearsAtCompany' # OK
'YearsInCurrentRole' # revisar los NAN - o ELIMINAR
'YearsSinceLastPromotion' # OK
'YEARSWITHCURRMANAGER' # OK
'SameAsMonthlyIncome' # revisar los NAN
'DateBirth' # OK
'Salary' # ELIMINADO
'RoleDepartament' # ELIMINADO
'NUMBERCHILDREN' # ELIMINADO
'RemoteWork' # OK

# Eliminar columnas üëåüèº ‚úÖ

- `employeecount` # Porque siempre es el mismo valor y es un contador de los empleados
- `Over18` # Porque ya tenemos la edad y tiene muchos valores perdidos
- `StandardHours` # Porque todos tienen el mismo valor que es 80 y ademas tienen muchos valores perdidos
- `Salary` # Porque es igual a 10000000$ en todos los valores del dataframe
- `NUMBERCHILDREN` # Porque no tiene ningun valor y es todo con valores missing.
- `roledepartament` # con un 81% de datos nulos y ya una columna en paralelo dice lo mismos datos

In [7]:
df.drop(["employeecount", "Over18", "StandardHours", "Salary", "NUMBERCHILDREN"], axis=1, inplace=True )

In [86]:
df.drop(['roledepartament'], axis=1, inplace=True)

In [87]:
df.head(1)

,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,remotework
unnamed: 0,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
0,51,No,NaN,684.0,NaN,6,3,NaN,"162,0",1,Male,51,3,5,research director,3,NaN,"19537,0",6462,7,No,13,"3,0",3,0,NaN,5,"3,0",20,NaN,15,15,"19537,0",1972,Yes

In [88]:
df.shape

(1614, 35)

----------

### `Homogeneizamos el nombre de las columnas a min√∫sculas` ‚úÖ

In [11]:
# vamos a iterar por todas las columnas del DataFrame y a cada una de ellas la pondremos en min√∫sula y le aplicaremos un replace para quitar los puntos. 
nuevas_columnas = {columna: columna.lower() for columna in df.columns}

# comprobamos que hemos creado el diccionario correctamente
nuevas_columnas

{'Unnamed: 0': 'unnamed: 0',
 'Age': 'age',
 'Attrition': 'attrition',
 'BusinessTravel': 'businesstravel',
 'DailyRate': 'dailyrate',
 'Department': 'department',
 'DistanceFromHome': 'distancefromhome',
 'Education': 'education',
 'EducationField': 'educationfield',
 'employeenumber': 'employeenumber',
 'EnvironmentSatisfaction': 'environmentsatisfaction',
 'Gender': 'gender',
 'HourlyRate': 'hourlyrate',
 'JobInvolvement': 'jobinvolvement',
 'JobLevel': 'joblevel',
 'JobRole': 'jobrole',
 'JobSatisfaction': 'jobsatisfaction',
 'MaritalStatus': 'maritalstatus',
 'MonthlyIncome': 'monthlyincome',
 'MonthlyRate': 'monthlyrate',
 'NUMCOMPANIESWORKED': 'numcompaniesworked',
 'OverTime': 'overtime',
 'PercentSalaryHike': 'percentsalaryhike',
 'PerformanceRating': 'performancerating',
 'RelationshipSatisfaction': 'relationshipsatisfaction',
 'StockOptionLevel': 'stockoptionlevel',
 'TOTALWORKINGYEARS': 'totalworkingyears',
 'TrainingTimesLastYear': 'trainingtimeslastyear',
 'WORKLIFEBALANCE': 'worklifebalance',
 'YearsAtCompany': 'yearsatcompany',
 'YearsInCurrentRole': 'yearsincurrentrole',
 'YearsSinceLastPromotion': 'yearssincelastpromotion',
 'YEARSWITHCURRMANAGER': 'yearswithcurrmanager',
 'SameAsMonthlyIncome': 'sameasmonthlyincome',
 'DateBirth': 'datebirth',
 'RoleDepartament': 'roledepartament',
 'RemoteWork': 'remotework'}

In [12]:
# una vez que tenemos el diccionario vamos a aplicar el m√©todo rename
df.rename(columns = nuevas_columnas, inplace = True)

# comprobamos que se han cambiado los nombres de las columnas
df.head()

,unnamed: 0,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeenumber,...,trainingtimeslastyear,worklifebalance,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,roledepartament,remotework
0,0,51,No,NaN,"684,0$",NaN,6,3,NaN,"162,0",...,5,"3,0",20,NaN,15,15,"19537,0",1972,NaN,Yes
1,1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,"259,0",...,5,"3,0",33,NaN,11,9,"19999,0",1971,NaN,1
2,2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,"319,0",...,3,NaN,22,NaN,11,15,"19232,0",1981,ManaGER - Research & Development,1
3,3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,NaN,...,2,NaN,20,NaN,5,6,"17169,0",1976,NaN,False
4,4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,NaN,...,5,"3,0",19,NaN,2,8,NaN,1977,NaN,0

--------

# `Falta crear un code para eliminar los nulos o hacer promedios donde sea necesario. `

--------

- `Cambiamos las letras de n√∫meros en la columna (age)` ‚úÖ
- `colocamos los datos de object a int` ‚úÖ
- `Falta guerdarlo directamente en el dataframe` ‚úÖ

In [35]:
df['age'].unique()

array([51, 52, 42, 47, 46, 48, 59, 41, 56, 38, 55, 40, 58, 35, 45, 33, 36,
       34, 53, 43, 60, 32, 37, 49, 39, 50, 44, 30, 29, 31, 54, 57, 27, 28,
       26, 25, 24, 23, 22, 21, 20, 19, 18])

In [15]:
# Diccionario para convertir palabras a n√∫meros
word_to_number = {
    'zero': 0, 'one': 1, 'two': 2, 'three': 3, 'four': 4, 'five': 5,
    'six': 6, 'seven': 7, 'eight': 8, 'nine': 9, 'ten': 10, 'eleven': 11,
    'twelve': 12, 'thirteen': 13, 'fourteen': 14, 'fifteen': 15,
    'sixteen': 16, 'seventeen': 17, 'eighteen': 18, 'nineteen': 19,
    'twenty': 20, 'thirty': 30, 'forty': 40, 'fifty': 50, 'sixty': 60,
    'seventy': 70, 'eighty': 80, 'ninety': 90
}

# Funci√≥n para convertir cadenas a n√∫meros
def convert_to_number(age):
    try:
        # Primero intentamos convertir directamente a entero
        return int(age)
    except ValueError:
        # Si falla, intentamos convertir usando el diccionario
        words = age.split('-')
        number = 0
        for word in words:
            if word in word_to_number:
                number += word_to_number[word]
            else:
                return f"Error converting '{age}'"
        return number

# Aplicar la funci√≥n de conversi√≥n a la columna 'Age' del DataFrame
df['age'] = df['age'].apply(convert_to_number)

# Verificar si hay errores en la conversi√≥n
errors = df['age'][df['age'].apply(lambda x: isinstance(x, str))]

# Mostrar los resultados
print("Converted Ages in DataFrame:")
print(df['age'].head())

if not errors.empty:
    print("\nErrors:")
    print(errors)
else:
    print("\nNo conversion errors.")

Converted Ages in DataFrame:
0    51
1    52
2    42
3    47
4    46
Name: age, dtype: int64

No conversion errors.

In [18]:
df['age'].shape

(1614,)

---------------

No requiere cambios ‚úÖ

In [20]:
df['attrition'].unique()

array(['No', 'Yes'], dtype=object)

---------

- `Separamos los string con espacio vacio('') y quitamos el (_)`‚úÖ
- `Eliminar los NAN`‚ùì

In [22]:
df['businesstravel'].unique()

array([nan, 'travel_rarely', 'travel_frequently', 'non-travel'],
      dtype=object)

In [27]:
df["businesstravel"] = df["businesstravel"].str.replace("_", " ").str.replace("-"," ")
df.sample(10)

,unnamed: 0,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeenumber,...,trainingtimeslastyear,worklifebalance,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,roledepartament,remotework
1009,1009,56,No,NaN,"718,0$",NaN,4,4,NaN,NaN,...,2,"3,0",5,NaN,4,2,NaN,1967,NaN,True
1579,1579,34,No,NaN,"1442,0$",NaN,9,3,Medical,"717,0",...,3,"4,0",8,NaN,7,7,NaN,1989,NaN,Yes
1595,1595,38,No,NaN,"240,0$",NaN,2,4,Life Sciences,"803,0",...,2,"3,0",15,NaN,4,12,"5980,0",1985,NaN,False
440,440,39,No,NaN,"1387,0$",Research & Development,10,5,Medical,NaN,...,3,"3,0",7,NaN,7,7,NaN,1984,maNuFAcTURInG DIReCtoR - Research & Develop...,0
73,73,38,No,travel frequently,"1189,0$",NaN,1,3,Life Sciences,"1668,0",...,4,NaN,13,NaN,2,9,"4735,0",1985,NaN,True
1610,1610,45,No,non travel,"805,0$",NaN,4,2,NaN,"972,0",...,5,"2,0",9,NaN,0,8,"4447,0",1978,NaN,1
247,247,36,No,NaN,"1383,0$",NaN,10,3,Life Sciences,"1790,0",...,1,"3,0",12,NaN,5,7,"8321,0",1987,NaN,False
301,301,29,No,travel frequently,"442,0$",NaN,2,2,NaN,"388,0",...,3,NaN,10,NaN,0,9,NaN,1994,NaN,True
879,879,23,No,NaN,"1309,0$",NaN,26,1,NaN,"465,0",...,2,"2,0",4,NaN,0,2,"2904,0",2000,NaN,0
1230,1230,21,No,travel rarely,"391,0$",NaN,15,2,NaN,"30,0",...,6,"3,0",0,NaN,0,0,NaN,2002,NaN,Yes

--------

- `Cambiar a float` ‚úÖ
- `Cambiar las comas(,) por puntos(.)` ‚úÖ

In [36]:
df['dailyrate'].unique()

array([ 684.,  699.,  532.,  359., 1319.,  117., 1435.,  635., 1276.,
        840.,  247., 1369.,  201., 1360.,  692., 1398.,  286., 1402.,
        819.,  884., 1238.,  515., 1223.,  202.,  928.,  607.,  266.,
        429.,  589.,   nan, 1180., 1282.,  776.,  665.,  526., 1034.,
       1403., 1499.,  580.,  859.,  263., 1376.,  885., 1003., 1321.,
        394., 1372., 1333.,  228.,  737.,  823.,  667.,  301.,  573.,
       1329.,  630., 1063., 1017., 1296.,  939., 1355., 1448.,  200.,
       1202.,  404.,  208.,  813.,  465., 1189., 1001., 1394.,  161.,
        288.,  682., 1354.,  147.,  119., 1413.,  452.,  334., 1132.,
        982.,  480., 1099.,  672., 1379.,  583., 1492., 1050.,  469.,
        237., 1440., 1291., 1157., 1336., 1224.,  735., 1389.,  638.,
       1240.,  194., 1339.,  111., 1469.,  470., 1232., 1249.,  798.,
        549.,  570.,  541.,  164., 1117.,  619.,  319.,  956., 1245.,
       1397.,  527.,  213.,  882.,  330.,  406.,  217.,  481.,  669.,
       1465.,  685., 1062.,  177., 1199.,  648.,  412.,  282.,  770.,
        601.,  855.,  332., 1326.,  748.,  405.,  790.,  971., 1370.,
        750.,  880.,  678., 1179.,  350., 1266.,  574.,  189.,  310.,
        722., 1219.,  994.,  721.,  853.,  427.,  852., 1334., 1093.,
        967.,  989., 1195., 1045.,  829.,  663., 1300., 1105.,  906.,
        849., 1275., 1218.,  422., 1274., 1076., 1207.,  430.,  933.,
       1184.,  586.,  890.,  379., 1425., 1188.,  938., 1053.,  248.,
        796.,  174.,  408.,  977.,  536.,  135., 1476.,  587.,  495.,
        523.,  507., 1055., 1445.,  218.,  447., 1029.,  674.,  538.,
        740., 1234.,  170., 1130.,  584.,  918.,  792.,  611., 1383.,
        867.,  706.,  728.,  311.,  556.,  937., 1125.,  444.,  911.,
        585., 1392., 1005., 1299.,  655.,  746.,  632.,  658., 1467.,
       1312.,  249.,  802.,  689., 1395., 1436., 1496., 1480.,  313.,
        894.,  290., 1084., 1002., 1242., 1052.,  944.,  771., 1416.,
       1327.,  488., 1385.,  666., 1315.,  442.,  950.,  691., 1018.,
        559.,  318.,  144., 1171.,  143., 1178., 1107.,  645., 1485.,
       1116.,  163.,  561.,  426.,  509.,  258.,  525.,  238.,  482.,
        397.,  243.,  806., 1442.,  929.,  827.,  703.,  294.,  314.,
        654.,  501.,  954., 1434.,  657.,  240.,  791.,  676.,  436.,
        760.,  661., 1085.,  154., 1283.,  616.,  498.,  530.,  805.,
        903., 1229.,  566., 1441.,  153., 1066.,  145., 1109.,  124.,
        300., 1366.,  857., 1204., 1082.,  203., 1308.,  718.,  593.,
       1384., 1361., 1146., 1316.,  363., 1103.,  920.,  694., 1429.,
        531.,  621.,  604.,  325., 1030.,  524.,  943., 1009.,  817.,
        930., 1147.,  652.,  337., 1136.,  326.,  377., 1038., 1490.,
       1246.,  224.,  441.,  898., 1313., 1015., 1387., 1302.,  602.,
        772.,  809.,  786.,  921.,  717.,  979.,  953.,  244.,  196.,
        303., 1092.,  261., 1422., 1137.,  511., 1396., 1096., 1169.,
       1239.,  157.,  754., 1303.,  697.,  116.,  557.,  582.,  704.,
        613.,  419.,  477., 1211.,  505.,  269.,  553., 1277.,  302.,
        975., 1318.,  881.,  466.,  945.,  433.,  991., 1083.,  136.,
        333., 1462., 1131., 1023., 1065., 1115., 1479.,  304., 1368.,
        828.,  799.,  142.,  446.,  254., 1410.,  883.,  121., 1343.,
        490., 1400., 1332., 1200., 1102., 1328.,  548., 1214.,  120.,
        841., 1033., 1452., 1268.,  307.,  797.,  555., 1377.,  210.,
        483.,  575., 1311.,  759.,  891.,  317.,  688.,  195.,  622.,
        646.,  719., 1012., 1278., 1222., 1231.,  462.,  231., 1089.,
       1262.,  439.,  528.,  647., 1097.,  942.,  966.,  168.,  299.,
        999., 1498., 1439., 1111., 1174.,  172.,  401.,  866.,  571.,
       1342.,  995.,  118.,  990.,  241., 1470.,  492., 1040., 1320.,
        146., 1153.,  185., 1297., 1064., 1351.,  468., 1273., 1141.,
       1488.,  653., 1225., 1217., 1127., 1427.,  702.,  926.,  878.,
        896., 1401.,  675., 1070.,  496.,  390., 1220., 1124., 1046.,
        267.,  443., 1287., 1420.,  562.,  650.,  141.,  715.,  376.,
        932.,  471.,  180., 1265., 1075., 1086.,  152.,  974.,  788.,
        192.,  150., 1167.,  206.,  736.,  322.,  683., 1475.,  560.,
        115.,  888.,  671.,  567.,  148.,  581.,  371., 1181., 1253.,
        370., 1194.,  572.,  355.,  783.,  155.,  508.,  642., 1382.,
       1037., 1120.,  374.,  287.,  591.,  670., 1346.,  103.,  673.,
        705., 1459., 1443., 1142.,  664.,  432., 1353.,  489.,  807.,
       1280.,  957.,  542.,  216., 1150.,  364., 1256.,  440.,  713.,
        140.,  629.,  328.,  472.,  905., 1151.,  644.,  992., 1323.,
        818., 1431.,  976.,  832.,  916., 1247.,  128., 1158.,  996.,
       1449.,  636.,  889.,  106.,  723., 1482.,  738., 1192., 1309.,
        544.,  641.,  756.,  895., 1261.,  329., 1362., 1371.,  821.,
       1381., 1473.,  296., 1349.,  986.,  413.,  988., 1474.,  232.,
       1236., 1112.,  204.,  913.,  810.,  693.,  316.,  381.,  775.,
        804., 1090.,  346.,  725.,  182.,  384., 1325., 1258., 1041.,
        625., 1418., 1269.,  395.,  341.,  500., 1454.,  617., 1122.,
       1198.,  188.,  335.,  461., 1134.,  138., 1206.,  109.,  277.,
        265.,  342., 1186.,  769., 1176., 1091.,  618.,  970.,  984.,
        793., 1182.,  603.,  874.,  367.,  199., 1457., 1421., 1450.,
       1212., 1010.,  131.,  193.,  640.,  848., 1138.,  256.,  935.,
        458.,  662.,  499.,  949.,  383., 1255., 1221.,  981., 1495.,
       1193.,  467.,  271.,  410., 1288., 1108.,  437.,  457.,  634.,
        546.,  711.,  448.,  365.,  763.,  486.,  392.,  727.,  741.,
        552.,  506., 1456.,  160.,  897.,  600., 1054.,  428.,  343.,
       1216.,  207.,  280.,  414.,  836.,  592.,  219., 1079., 1251.,
       1168., 1444., 1154.,  234.,  529., 1322.,  924.,  134.,  755.,
        253.,  922., 1365.,  306., 1271., 1404., 1391., 1464., 1330.,
        773.,  902.,  107.,  504., 1358.,  824.,  594.,  734.,  766.,
        431., 1213., 1373., 1324., 1123.,  391.,  125., 1357.,  626.,
        132.,  871., 1031., 1145.,  854., 1411.,  252.,  833., 1210.,
       1463.,  812., 1162.,  845., 1144.,  156.,  464., 1305.,  983.,
        534., 1306., 1094.,  558.,  959.,  782.,  362.,  268.,  167.,
       1243.,  720.,  868., 1252.,  781., 1272.,  129., 1069.,  289.,
        955.,  660.,  415.,  309.,  130.,  862., 1098.,  969.,  373.,
        599.,  968.,  830., 1423.,  516.,  598.,  104.,  479.,  474.,
        264., 1059.,  563., 1259.,  369.,  543.,  964.,  176.,  181.,
        211.,  590.,  305.,  478., 1294., 1128.,  726.,  352., 1172.,
        605., 1337.,  105.])

In [50]:
df['dailyrate'] = df['dailyrate'].str.replace(",", ".").str.replace("$", "")
df['dailyrate'].unique()

array(['684.0', '699.0', '532.0', '359.0', '1319.0', '117.0', '1435.0',
       '635.0', '1276.0', '840.0', '247.0', '1369.0', '201.0', '1360.0',
       '692.0', '1398.0', '286.0', '1402.0', '819.0', '884.0', '1238.0',
       '515.0', '1223.0', '202.0', '928.0', '607.0', '266.0', '429.0',
       '589.0', 'nan', '1180.0', '1282.0', '776.0', '665.0', '526.0',
       '1034.0', '1403.0', '1499.0', '580.0', '859.0', '263.0', '1376.0',
       '885.0', '1003.0', '1321.0', '394.0', '1372.0', '1333.0', '228.0',
       '737.0', '823.0', '667.0', '301.0', '573.0', '1329.0', '630.0',
       '1063.0', '1017.0', '1296.0', '939.0', '1355.0', '1448.0', '200.0',
       '1202.0', '404.0', '208.0', '813.0', '465.0', '1189.0', '1001.0',
       '1394.0', '161.0', '288.0', '682.0', '1354.0', '147.0', '119.0',
       '1413.0', '452.0', '334.0', '1132.0', '982.0', '480.0', '1099.0',
       '672.0', '1379.0', '583.0', '1492.0', '1050.0', '469.0', '237.0',
       '1440.0', '1291.0', '1157.0', '1336.0', '1224.0', '735.0',
       '1389.0', '638.0', '1240.0', '194.0', '1339.0', '111.0', '1469.0',
       '470.0', '1232.0', '1249.0', '798.0', '549.0', '570.0', '541.0',
       '164.0', '1117.0', '619.0', '319.0', '956.0', '1245.0', '1397.0',
       '527.0', '213.0', '882.0', '330.0', '406.0', '217.0', '481.0',
       '669.0', '1465.0', '685.0', '1062.0', '177.0', '1199.0', '648.0',
       '412.0', '282.0', '770.0', '601.0', '855.0', '332.0', '1326.0',
       '748.0', '405.0', '790.0', '971.0', '1370.0', '750.0', '880.0',
       '678.0', '1179.0', '350.0', '1266.0', '574.0', '189.0', '310.0',
       '722.0', '1219.0', '994.0', '721.0', '853.0', '427.0', '852.0',
       '1334.0', '1093.0', '967.0', '989.0', '1195.0', '1045.0', '829.0',
       '663.0', '1300.0', '1105.0', '906.0', '849.0', '1275.0', '1218.0',
       '422.0', '1274.0', '1076.0', '1207.0', '430.0', '933.0', '1184.0',
       '586.0', '890.0', '379.0', '1425.0', '1188.0', '938.0', '1053.0',
       '248.0', '796.0', '174.0', '408.0', '977.0', '536.0', '135.0',
       '1476.0', '587.0', '495.0', '523.0', '507.0', '1055.0', '1445.0',
       '218.0', '447.0', '1029.0', '674.0', '538.0', '740.0', '1234.0',
       '170.0', '1130.0', '584.0', '918.0', '792.0', '611.0', '1383.0',
       '867.0', '706.0', '728.0', '311.0', '556.0', '937.0', '1125.0',
       '444.0', '911.0', '585.0', '1392.0', '1005.0', '1299.0', '655.0',
       '746.0', '632.0', '658.0', '1467.0', '1312.0', '249.0', '802.0',
       '689.0', '1395.0', '1436.0', '1496.0', '1480.0', '313.0', '894.0',
       '290.0', '1084.0', '1002.0', '1242.0', '1052.0', '944.0', '771.0',
       '1416.0', '1327.0', '488.0', '1385.0', '666.0', '1315.0', '442.0',
       '950.0', '691.0', '1018.0', '559.0', '318.0', '144.0', '1171.0',
       '143.0', '1178.0', '1107.0', '645.0', '1485.0', '1116.0', '163.0',
       '561.0', '426.0', '509.0', '258.0', '525.0', '238.0', '482.0',
       '397.0', '243.0', '806.0', '1442.0', '929.0', '827.0', '703.0',
       '294.0', '314.0', '654.0', '501.0', '954.0', '1434.0', '657.0',
       '240.0', '791.0', '676.0', '436.0', '760.0', '661.0', '1085.0',
       '154.0', '1283.0', '616.0', '498.0', '530.0', '805.0', '903.0',
       '1229.0', '566.0', '1441.0', '153.0', '1066.0', '145.0', '1109.0',
       '124.0', '300.0', '1366.0', '857.0', '1204.0', '1082.0', '203.0',
       '1308.0', '718.0', '593.0', '1384.0', '1361.0', '1146.0', '1316.0',
       '363.0', '1103.0', '920.0', '694.0', '1429.0', '531.0', '621.0',
       '604.0', '325.0', '1030.0', '524.0', '943.0', '1009.0', '817.0',
       '930.0', '1147.0', '652.0', '337.0', '1136.0', '326.0', '377.0',
       '1038.0', '1490.0', '1246.0', '224.0', '441.0', '898.0', '1313.0',
       '1015.0', '1387.0', '1302.0', '602.0', '772.0', '809.0', '786.0',
       '921.0', '717.0', '979.0', '953.0', '244.0', '196.0', '303.0',
       '1092.0', '261.0', '1422.0', '1137.0', '511.0', '1396.0', '1096.0',
       '1169.0', '1239.0', '157.0', '754.0', '1303.0', '697.0', '116.0',
       '557.0', '582.0', '704.0', '613.0', '419.0', '477.0', '1211.0',
       '505.0', '269.0', '553.0', '1277.0', '302.0', '975.0', '1318.0',
       '881.0', '466.0', '945.0', '433.0', '991.0', '1083.0', '136.0',
       '333.0', '1462.0', '1131.0', '1023.0', '1065.0', '1115.0',
       '1479.0', '304.0', '1368.0', '828.0', '799.0', '142.0', '446.0',
       '254.0', '1410.0', '883.0', '121.0', '1343.0', '490.0', '1400.0',
       '1332.0', '1200.0', '1102.0', '1328.0', '548.0', '1214.0', '120.0',
       '841.0', '1033.0', '1452.0', '1268.0', '307.0', '797.0', '555.0',
       '1377.0', '210.0', '483.0', '575.0', '1311.0', '759.0', '891.0',
       '317.0', '688.0', '195.0', '622.0', '646.0', '719.0', '1012.0',
       '1278.0', '1222.0', '1231.0', '462.0', '231.0', '1089.0', '1262.0',
       '439.0', '528.0', '647.0', '1097.0', '942.0', '966.0', '168.0',
       '299.0', '999.0', '1498.0', '1439.0', '1111.0', '1174.0', '172.0',
       '401.0', '866.0', '571.0', '1342.0', '995.0', '118.0', '990.0',
       '241.0', '1470.0', '492.0', '1040.0', '1320.0', '146.0', '1153.0',
       '185.0', '1297.0', '1064.0', '1351.0', '468.0', '1273.0', '1141.0',
       '1488.0', '653.0', '1225.0', '1217.0', '1127.0', '1427.0', '702.0',
       '926.0', '878.0', '896.0', '1401.0', '675.0', '1070.0', '496.0',
       '390.0', '1220.0', '1124.0', '1046.0', '267.0', '443.0', '1287.0',
       '1420.0', '562.0', '650.0', '141.0', '715.0', '376.0', '932.0',
       '471.0', '180.0', '1265.0', '1075.0', '1086.0', '152.0', '974.0',
       '788.0', '192.0', '150.0', '1167.0', '206.0', '736.0', '322.0',
       '683.0', '1475.0', '560.0', '115.0', '888.0', '671.0', '567.0',
       '148.0', '581.0', '371.0', '1181.0', '1253.0', '370.0', '1194.0',
       '572.0', '355.0', '783.0', '155.0', '508.0', '642.0', '1382.0',
       '1037.0', '1120.0', '374.0', '287.0', '591.0', '670.0', '1346.0',
       '103.0', '673.0', '705.0', '1459.0', '1443.0', '1142.0', '664.0',
       '432.0', '1353.0', '489.0', '807.0', '1280.0', '957.0', '542.0',
       '216.0', '1150.0', '364.0', '1256.0', '440.0', '713.0', '140.0',
       '629.0', '328.0', '472.0', '905.0', '1151.0', '644.0', '992.0',
       '1323.0', '818.0', '1431.0', '976.0', '832.0', '916.0', '1247.0',
       '128.0', '1158.0', '996.0', '1449.0', '636.0', '889.0', '106.0',
       '723.0', '1482.0', '738.0', '1192.0', '1309.0', '544.0', '641.0',
       '756.0', '895.0', '1261.0', '329.0', '1362.0', '1371.0', '821.0',
       '1381.0', '1473.0', '296.0', '1349.0', '986.0', '413.0', '988.0',
       '1474.0', '232.0', '1236.0', '1112.0', '204.0', '913.0', '810.0',
       '693.0', '316.0', '381.0', '775.0', '804.0', '1090.0', '346.0',
       '725.0', '182.0', '384.0', '1325.0', '1258.0', '1041.0', '625.0',
       '1418.0', '1269.0', '395.0', '341.0', '500.0', '1454.0', '617.0',
       '1122.0', '1198.0', '188.0', '335.0', '461.0', '1134.0', '138.0',
       '1206.0', '109.0', '277.0', '265.0', '342.0', '1186.0', '769.0',
       '1176.0', '1091.0', '618.0', '970.0', '984.0', '793.0', '1182.0',
       '603.0', '874.0', '367.0', '199.0', '1457.0', '1421.0', '1450.0',
       '1212.0', '1010.0', '131.0', '193.0', '640.0', '848.0', '1138.0',
       '256.0', '935.0', '458.0', '662.0', '499.0', '949.0', '383.0',
       '1255.0', '1221.0', '981.0', '1495.0', '1193.0', '467.0', '271.0',
       '410.0', '1288.0', '1108.0', '437.0', '457.0', '634.0', '546.0',
       '711.0', '448.0', '365.0', '763.0', '486.0', '392.0', '727.0',
       '741.0', '552.0', '506.0', '1456.0', '160.0', '897.0', '600.0',
       '1054.0', '428.0', '343.0', '1216.0', '207.0', '280.0', '414.0',
       '836.0', '592.0', '219.0', '1079.0', '1251.0', '1168.0', '1444.0',
       '1154.0', '234.0', '529.0', '1322.0', '924.0', '134.0', '755.0',
       '253.0', '922.0', '1365.0', '306.0', '1271.0', '1404.0', '1391.0',
       '1464.0', '1330.0', '773.0', '902.0', '107.0', '504.0', '1358.0',
       '824.0', '594.0', '734.0', '766.0', '431.0', '1213.0', '1373.0',
       '1324.0', '1123.0', '391.0', '125.0', '1357.0', '626.0', '132.0',
       '871.0', '1031.0', '1145.0', '854.0', '1411.0', '252.0', '833.0',
       '1210.0', '1463.0', '812.0', '1162.0', '845.0', '1144.0', '156.0',
       '464.0', '1305.0', '983.0', '534.0', '1306.0', '1094.0', '558.0',
       '959.0', '782.0', '362.0', '268.0', '167.0', '1243.0', '720.0',
       '868.0', '1252.0', '781.0', '1272.0', '129.0', '1069.0', '289.0',
       '955.0', '660.0', '415.0', '309.0', '130.0', '862.0', '1098.0',
       '969.0', '373.0', '599.0', '968.0', '830.0', '1423.0', '516.0',
       '598.0', '104.0', '479.0', '474.0', '264.0', '1059.0', '563.0',
       '1259.0', '369.0', '543.0', '964.0', '176.0', '181.0', '211.0',
       '590.0', '305.0', '478.0', '1294.0', '1128.0', '726.0', '352.0',
       '1172.0', '605.0', '1337.0', '105.0'], dtype=object)

In [51]:
df['dailyrate'] = df['dailyrate'].astype(float)

In [52]:
df.sample()

,unnamed: 0,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeenumber,...,trainingtimeslastyear,worklifebalance,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,roledepartament,remotework
1249,1249,20,Yes,NaN,871.0,research & development,6,3,life sciences,"137,0",...,5,"3,0",1,NaN,1,0,"2926,0",2003,LaBORatORy tEchNiCian - Research & Developm...,False

--------

- `Eliminar los NAN`‚ùì
- `Cambiar a min√∫scula los datos`‚úÖ

In [35]:
df['department'].unique()

array([nan, ' Research & Development ', ' Sales ', ' Human Resources '],
      dtype=object)

In [36]:
df['department'] = df['department'].str.lower()
df.head()

,unnamed: 0,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeenumber,...,trainingtimeslastyear,worklifebalance,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,roledepartament,remotework
0,0,51,No,NaN,684.0$,NaN,6,3,NaN,"162,0",...,5,"3,0",20,NaN,15,15,"19537,0",1972,NaN,Yes
1,1,52,No,NaN,699.0$,NaN,1,4,Life Sciences,"259,0",...,5,"3,0",33,NaN,11,9,"19999,0",1971,NaN,1
2,2,42,No,travel rarely,532.0$,research & development,4,2,Technical Degree,"319,0",...,3,NaN,22,NaN,11,15,"19232,0",1981,ManaGER - Research & Development,1
3,3,47,No,travel rarely,359.0$,NaN,2,4,Medical,NaN,...,2,NaN,20,NaN,5,6,"17169,0",1976,NaN,False
4,4,46,No,NaN,1319.0$,NaN,3,3,Technical Degree,NaN,...,5,"3,0",19,NaN,2,8,NaN,1977,NaN,0

-----------

`Cambiar los n√∫meros a positivos los que est√°n negativos`‚úÖ

In [43]:
df['distancefromhome'] = df['distancefromhome'].abs()

In [44]:
df['distancefromhome'].unique()

array([ 6,  1,  4,  2,  3, 22, 25,  9,  7, 23, 10, 12, 14, 13, 15,  8, 42,
       28, 37,  5, 16, 35, 26, 24, 29, 17, 21, 18, 30, 27, 20, 31, 39, 11,
       19, 33, 34, 46, 36, 45, 47, 32, 41, 49, 48, 38, 43, 40, 44])

---------

No requiere cambios ‚úÖ

In [45]:
df['education'].unique()

array([3, 4, 2, 1, 5])

--------

- `cambiar a min√∫scula todo` ‚úÖ
- `Eliminar los NAN`

In [47]:
df['educationfield'] = df['educationfield'].str.lower()
df.head()

,unnamed: 0,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeenumber,...,trainingtimeslastyear,worklifebalance,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,roledepartament,remotework
0,0,51,No,NaN,684.0$,NaN,6,3,NaN,"162,0",...,5,"3,0",20,NaN,15,15,"19537,0",1972,NaN,Yes
1,1,52,No,NaN,699.0$,NaN,1,4,life sciences,"259,0",...,5,"3,0",33,NaN,11,9,"19999,0",1971,NaN,1
2,2,42,No,travel rarely,532.0$,research & development,4,2,technical degree,"319,0",...,3,NaN,22,NaN,11,15,"19232,0",1981,ManaGER - Research & Development,1
3,3,47,No,travel rarely,359.0$,NaN,2,4,medical,NaN,...,2,NaN,20,NaN,5,6,"17169,0",1976,NaN,False
4,4,46,No,NaN,1319.0$,NaN,3,3,technical degree,NaN,...,5,"3,0",19,NaN,2,8,NaN,1977,NaN,0

In [48]:
df['educationfield'].unique()

array([nan, 'life sciences', 'technical degree', 'medical', 'other',
       'marketing', 'human resources'], dtype=object)

--------

Eliminado ‚ùå

In [ ]:
df['employeecount'].unique()

-------

# `Eliminar duplicados`
- Revisar bien cada registro para tomar una decisi√≥n

In [140]:
df['employeenumber'].unique()

array(['162,0', '259,0', '319,0', ..., '2012,0', '2023,0', '2040,0'],
      dtype=object)

In [243]:
df['employeenumber'].duplicated().sum()

534

In [245]:
df['employeenumber'].value_counts()

employeenumber
482,0     2
530,0     2
507,0     2
517,0     2
522,0     2
         ..
161,0     1
164,0     1
190,0     1
194,0     1
2040,0    1
Name: count, Length: 1079, dtype: int64

---------------------

No requiere cambios ‚úÖ

In [141]:
df['EnvironmentSatisfaction'].unique()

array([ 1,  3,  4,  2, 42, 37, 35, 25, 27, 31, 39, 21, 15, 14, 33, 19, 12,
       13, 28, 47, 36, 29, 24, 46, 16, 22, 41, 49, 11, 48, 18, 10, 45, 38,
       17, 20, 26, 43])

-------------

- `cambiar de 0 - 1 a Male/Female o M/F`‚úÖ
- `convertir en object ya que antes era int`‚úÖ

In [54]:
df['gender'] = df['gender'].replace({0: 'Male', 1: 'Female'})

In [55]:
df['gender'].unique()

array(['Male', 'Female'], dtype=object)

--------

- `Cambiar a formato de hora  o int`‚úÖ
- `Eliminar el Not Available`‚úÖ

In [90]:
# Rellenar los valores NA con 0 o cualquier otro valor predeterminado
df.hourlyrate = df.hourlyrate.replace({'Not Available': 0})

In [91]:

# Convertir la columna a enteros
df['hourlyrate'] = df['hourlyrate'].astype(int)

In [92]:
df['hourlyrate'].unique()

array([ 51,  65,  58,  82,  45,  99,  91,  64,  55,  68,  49,  61,  79,
        31,  69,  48,  80,  74,  98,  59,  33,  56,  66,  57,  53,  87,
        81,  84,  32,  41,  92,  47,   0,  43,  86,  30,  42,  88,  96,
        67,  62,  72,  78,  89,  52,  50,  90,  37,  94,  76,  60,  46,
        83, 100,  40,  97,  54,  75,  39,  85,  63,  44,  93,  36,  35,
        73,  71,  70,  38,  77,  95,  34])

------

No requiere cambios ‚úÖ

In [57]:
df['jobinvolvement'].unique()

array([3, 2, 4, 1])

-------

No requiere cambios ‚úÖ

In [58]:
df['joblevel'].unique()

array([5, 4, 3, 2, 1])

-----------

- `cambiar a min√∫sculas` ‚úÖ

In [62]:
df['jobrole'] = df['jobrole'].str.lower()

In [63]:
df['jobrole'].unique()

array([' research director ', ' manager ', ' sales executive ',
       ' manufacturing director ', ' research scientist ',
       ' healthcare representative ', ' laboratory technician ',
       ' sales representative ', ' human resources '], dtype=object)

-------

No requiere cambios ‚úÖ

In [64]:
df['jobsatisfaction'].unique()

array([3, 4, 1, 2])

-------

- `cambiar a min√∫sculas` ‚úÖ
- `Eliminar los NAN`
- `Eliminar la plabras 'Marreid' ` ‚úÖ

In [34]:
df["maritalstatus"] = df["maritalstatus"].str.lower()
df["maritalstatus"] = df["maritalstatus"].str.replace('marreid', 'married')

In [35]:
df['maritalstatus'].unique()

array([nan, 'married', 'divorced', 'single'], dtype=object)

-------

- ` quitar las comas por puntos `‚úÖ
- `tiene NAN`

In [93]:
def cambiar_comas(cadena):
    try:
        return float(cadena.replace(',', '').replace('.', ''))
    except:
        return np.nan
df['monthlyincome'] = df['monthlyincome'].apply(cambiar_comas)

In [94]:
df['monthlyincome'].unique()

array([195370., 199990., 192320., 171690.,     nan, 171740., 165950.,
       199730., 134020., 132060., 195450., 180410., 192460., 107480.,
       167520.,  62010., 198450.,  40010., 104470., 160640.,  32100.,
       102660., 104750.,  61620.,  47210.,  46150., 169590., 103060.,
        54060.,  59020., 108550.,  59140.,  66460., 139730., 133200.,
        66870.,  47350., 138720., 190450., 160150.,  96130., 115100.,
        43060., 170460.,  50670.,  36920., 198470.,  23080.,  57470.,
       104220.,  63470.,  23480.,  30720., 124900.,  80200., 170680.,
        89430., 192720.,  55770.,  26910.,  74030.,  88230.,  35790.,
       177790., 182130., 135770., 191900., 171230., 191870., 100080.,
        79880.,  70830.,  47230.,  34070.,  29290., 120310., 154270.,
        51260.,  96190.,  50100., 190330., 104000.,  27930.,  56740.,
       191970.,  84120.,  33480.,  53090.,  76540., 128080.,  65860.,
        25190., 170990., 131200.,  31310.,  44440.,  66740.,  98520.,
       178610.,  74460., 137570., 165980.,  42850., 101240.,  97140.,
        99240., 112450.,  30690.,  92410.,  64720.,  30550.,  83210.,
        31430.,  85780.,  41970.,  98880., 133410.,  56770.,  29090.,
        95260.,  68250.,  44240.,  54410.,  60740.,  61460.,  61720.,
        46680.,  56050.,  43190.,  35640.,  62610.,  68040., 194360.,
        58280.,  24550.,  50550.,  46820.,  52570.,  21190.,  59740.,
        30340., 132120.,  83920.,  40510.,  48050.,  27410.,  53370.,
        94340.,  53960., 111590.,  49600.,  87930., 191890.,  22160.,
       117130.,  53040., 111030.,  66320.,  75870.,  43350.,  59800.,
        42440.,  52280.,  27000.,  23660.,  23290.,  42940.,  67250.,
       103250.,  44470., 108450.,  54720.,  63850.,  75250.,  36600.,
        87400., 134990.,  34910.,  52200., 102520., 197400.,  62090.,
        70940.,  45340.,  85000.,  46390.,  53630.,  40810.,  35780.,
       173280., 107930., 108510., 104660.,  23620.,  64390.,  57690.,
        43850.,  40660.,  52060.,  26550.,  25700.,  45020.,  49680.,
        51470.,  27180.,  35390.,  54680.,  58130.,  96670.,  51540.,
        56750.,  73140.,  50980., 135700.,  67120.,  99910., 102480.,
       109380.,  25930., 118780.,  80950., 168560.,  45370., 179240.,
        40140., 127420.,  33760., 104820.,  42490.,  65490., 144110.,
       195860.,  82370.,  32110., 167040.,  47740.,  45680.,  59930.,
        64990.,  34520.,  63970.,  27250.,  36220.,  61800.,  62740.,
        43810.,  25590.,  54880.,  25140.,  31960.,  34200.,  40870.,
        53680., 129360.,  42210.,  49630.,  42000.,  50060.,  76390.,
        65020., 135250.,  63490.,  63800.,  31020.,  45560.,  42300.,
        48590.,  63220., 107610.,  29730.,  52040., 173990., 168850.,
        43230.,  51550.,  29360., 187890.,  48830.,  20290.,  29960.,
        92780.,  41620.,  88530.,  48760.,  21410.,  77560.,  39360.,
        68420.,  39890.,  49300.,  37020.,  27050.,  44480.,  23790.,
        54870.,  28100.,  89380.,  99360.,  54540., 187400.,  54730.,
       135030., 135490., 181720.,  27740.,  94390.,  52650.,  38150.,
        23890.,  40000., 175840.,  56610.,  48690.,  46490., 104960.,
        27680.,  34080.,  37550.,  21870.,  42580.,  53260.,  54850.,
        27820., 176390.,  60620.,  62880.,  34240.,  41940.,  25320.,
        56660., 137260.,  41070.,  35970.,  41150.,  62720.,  25170.,
        39040.,  92040.,  43730.,  20640.,  24300.,  48770.,  37600.,
        20130.,  29740.,  27660.,  33770.,  42130.,  65130.,  42840.,
        22260.,  55610.,  21440.,  53730.,  28970.,  53210.,  54100.,
        48500.,  20010.,  44040.,  39440.,  29600., 189470.,  64650.,
        26830.,  20140.,  34410., 136640.,  50210., 188440.,  47390.,
       106500.,  43170.,  20240.,  30580.,  39290.,  44250.,  23280.,
        26570.,  59400.,  26220.,  32120.,  29110.,  69310.,  21760.,
        32300., 186650.,  27890.,  64100.,  49410.,  39830.,  29040.,
        26960.,  21740.,  67550., 109650.,  25430., 194060.,  65380.,
        22580.,  22180.,  26540., 119350.,  25460.,  38940.,  42620.,
       105270.,  24000.,  36810.,  34470., 195130.,  26590.,  88470.,
        20450.,  48510.,  81200.,  45770.,  54050.,  37080., 137700.,
        22970.,  24500.,  43420.,  25720.,  65000.,  31490.,  53240.,
        43820.,  25530.,  59330.,  44030., 109340.,  20220.,  42560.,
        35800.,  28990.,  55620.,  23770.,  24040.,  27990.,  28110.,
        43770.,  42400.,  42270.,  39170.,  49690.,  20420.,  28210.,
        99570.,  22070.,  20700.,  27910.,  82240.,  26100.,  57310.,
        25390.,  23760., 190810.,  27430.,  45380.,  38670.,  20800.,
        20960.,  46270.,  23020.,  50710., 105960.,  54670.,  23940.,
        36290.,  93620.,  32290., 164220.,  56470.,  44000.,  20660.,
        54860.,  31620.,  66510.,  48980.,  31800., 112440.,  40690.,
        63920.,  48550.,  33120.,  31170., 152020.,  25800.,  21660.,
        43740.,  55050.,  25870., 159720.,  23050.,  34330.,  34770.,
        39070.,  34450.,  27600.,  62940., 131160.,  35910.,  21050.,
        39020.,  26620.,  20620.,  55070.,  81030.,  39780.,  53990.,
       104480.,  44400.,  26600.,  33750.,  22690.,  47870.,  28090.,
       108540.,  25710.,  61420.,  24960.,  34190.,  25010.,  25660.,
        39200., 139640.,  65400.,  22440., 161840.,  42330., 148140.,
       171590.,  23180.,  36170.,  26840., 192370.,  44220.,  25520.,
        26780.,  51710., 119160.,  93800.,  58780.,  24680.,  41270.,
        21480.,  38860.,  66670.,  20900.,  20860.,  19510.,  30220.,
        97240.,  33880.,  30380.,  23220.,  29260.,  45050.,  28350.,
        65530.,  66730., 135910.,  21770., 195170., 192020., 100480.,
        27230.,  66440.,  31610.,  14200.,  12000.,  52380.,  99850.,
       159920.,  23700.,  67810.,  66530.,  28510.,  52580.,  24760.,
        22850.,  34480.,  45580.,  17020.,  25640.,  50700.,  37800.,
        98240.,  18780.,  23400.,  21270.,  20330.,  96020., 166270.,
        20830.,  10090.,  78610.,  26420.,  51210.,  26940.,  50940.,
        22740.,  23140.,  23800.,  20080., 105520.,  22590.,  24130.,
        21210.,  24790., 131940.,  41630.,  26000., 183030.,  47770.,
        10520.,  24610.,  25960.,  47280.,  73510.,  47660.,  28270.,
        28530.,  22900.,  21070.,  22100., 131910., 182650.,  11180.,
        23720.,  28380., 180610.,  16110.,  47680.,  12740.,  25610.,
        15630.,  63880.,  83760.,  48410.,  20740.,  29720.,  68150.,
        26900., 175670.,  15690.,  41870.,  33060.,  13930., 108830.,
        28620.,  67350.,  97560.,  52940.,  24370.,  40710.,  29560.,
        46480.,  28040.,  24390.,  28560.,  29330.,  10910.,  51510.,
        28630.,  28580.,  11290., 194310.])

-------

No requiere cambios ‚úÖ

In [40]:
df['monthlyrate'].unique()

array([ 6462,  5678,  4933, ..., 15302, 26956, 16642])

-------------------------

No requiere cambios ‚úÖ

In [42]:
df["numcompaniesworked"].unique()

array([7, 0, 1, 3, 2, 4, 8, 9, 5, 6])

-------

Eliminado ‚ùå

In [ ]:
df['Over18'].unique()

-------

`hay un 42% de nulos, quiz√°s eliminarla? - Eliminar los NAN`

In [24]:
df['overtime'].isnull().sum()/df.shape[0]

0.4188351920693928

In [26]:
df["overtime"].unique()

array(['No', nan, 'Yes'], dtype=object)

-------

No requiere cambios ‚úÖ

In [30]:
df['percentsalaryhike'].unique()

array([13, 14, 11, 19, 12, 25, 16, 17, 22, 23, 20, 15, 21, 24, 18])

-------

- `volverlo int o float` ‚úÖ
- `Quitarle la coma y por puntos` ‚úÖ
- `Eliminar los NAN `

In [95]:
df['performancerating'] = df['performancerating'].str.replace(",", ".")

In [96]:
df['performancerating'] = df['performancerating'].astype(float)

In [97]:
df["performancerating"].unique()

array([ 3.,  4., nan])

-------

No requiere cambios ‚úÖ

In [28]:
df["relationshipsatisfaction"].unique()

array([3, 1, 4, 2])

-------

Eliminado ‚ùå

In [ ]:
df["standardhours"].unique()

-------

No requiere cambios ‚úÖ

In [158]:
df["stockoptionlevel"].unique()

array([0, 1, 2, 3])

-------

In [98]:
# Funici√≥n unica que cambia los valores de las columnas de totalworkingyears, sameasmonthlyincome worklifebalance

def cambiar_comas_y_nulos(cadena):
    if pd.isnull(cadena):  # Si es un valor nulo, devuelve NaN
        return np.nan
    try:
        return float(cadena.replace(',', '.'))  # Intenta convertir la cadena a float
    except ValueError:  # Si la conversi√≥n falla, devuelve NaN
        return np.nan

# Lista de las columnas que deseas modificar
columnas_a_convertir = ['totalworkingyears', 'sameasmonthlyincome', 'worklifebalance']

# Aplica la funci√≥n a cada columna en la lista
for columna in columnas_a_convertir:
    df[columna] = df[columna].apply(cambiar_comas_y_nulos)

- `Cambiar a int o float ` ‚úÖ
- `Eliminar los NAN `

In [99]:
df["totalworkingyears"].unique()

array([nan, 34., 22., 28., 20., 21., 33., 40., 18., 25., 15., 17., 26.,
       16., 24., 14., 23., 27., 19., 11., 38., 37., 13., 12., 29., 10.,
       36., 35.,  9., 31., 32.,  8.,  7., 30.,  6.,  5.,  4.,  3.,  2.,
        1.,  0.])

-------

No requiere cambios ‚úÖ

In [44]:
df["trainingtimeslastyear"].unique()

array([5, 3, 2, 0, 1, 4, 6])

-----------

- `Tiene NAN`
- `cambiar a int o float` ‚úÖ

In [63]:
df['worklifebalance'].unique()

array([ 3., nan,  2.,  4.,  1.])

-------

No requiere cambios ‚úÖ

In [10]:
df['yearsatcompany'].unique()

array([20, 33, 22, 19, 21, 18, 24, 31, 26, 16, 23, 15, 17, 32, 14, 13, 25,
       12, 11, 37, 40, 36, 27, 29, 10,  9, 30,  8,  7, 34,  6,  5,  4,  2,
        3,  1,  0])

-------

- `cambiar a int`
- `Elimiar los NAN`
- `revisar si Eliminar la clumna porque tiene 90% null`

In [163]:
df['yearsincurrentrole'].unique()

array([nan, '13,0', '12,0', '11,0', '7,0', '6,0', '4,0', '3,0', '2,0',
       '1,0', '0,0'], dtype=object)

-------

No requiere cambios ‚úÖ

In [46]:
df['yearssincelastpromotion'].unique()

array([15, 11,  5,  2,  4,  7,  0,  1, 13, 14,  8, 12,  3,  6, 10,  9])

-------

No requiere cambios ‚úÖ

In [6]:
df['yearswithcurrmanager'].unique()

array([15,  9,  6,  8,  7, 11, 10, 12,  4,  0,  5, 17,  2, 14,  1, 13,  3,
       16])

-------

- `Cambiar a int o float` ‚úÖ
- `Tienen NAN`

In [64]:
df["sameasmonthlyincome"].unique()

array([19537., 19999., 19232., 17169.,    nan, 17174., 16595., 19973.,
       13402., 13206., 19545., 18041., 19246., 10748., 16752.,  6201.,
       19845.,  4001., 10447., 16064.,  3210., 10266., 10475.,  6162.,
        4721.,  4615., 16959., 10306.,  5406.,  5902., 10855.,  5914.,
        6646., 13973., 13320.,  6687.,  4735., 13872., 19045., 16015.,
        9613., 11510.,  4306., 17046.,  5067.,  3692., 19847.,  2308.,
        5747., 10422.,  6347.,  2348.,  3072., 12490.,  8020., 17068.,
        8943., 19272.,  5577.,  2691.,  7403.,  8823.,  3579., 17779.,
       18213., 13577., 19190., 17123., 19187., 10008.,  7988.,  7083.,
        4723.,  3407.,  2929., 12031., 15427.,  5126.,  9619.,  5010.,
       19033., 10400.,  2793.,  5674., 19197.,  8412.,  3348.,  5309.,
        7654., 12808.,  6586.,  2519., 17099., 13120.,  3131.,  4444.,
        6674.,  9852., 17861.,  7446., 13757., 16598.,  4285., 10124.,
        9714.,  9924., 11245.,  3069.,  9241.,  6472.,  3055.,  8321.,
        3143.,  8578.,  4197.,  9888., 13341.,  5677.,  2909.,  9526.,
        6825.,  4424.,  5441.,  6074.,  6146.,  6172.,  4668.,  5605.,
        4319.,  3564.,  6261.,  6804., 19436.,  5828.,  2455.,  5055.,
        4682.,  5257.,  2119.,  5974.,  3034., 13212.,  8392.,  4051.,
        4805.,  2741.,  5337.,  9434.,  5396., 11159.,  4960.,  8793.,
       19189.,  2216., 11713.,  5304., 11103.,  6632.,  7587.,  4335.,
        5980.,  4244.,  5228.,  2700.,  2366.,  2329.,  4294.,  6725.,
       10325.,  4447., 10845.,  5472.,  6385.,  7525.,  3660.,  8740.,
       13499.,  3491.,  5220., 10252., 19740.,  6209.,  7094.,  4534.,
        8500.,  4639.,  5363.,  4081.,  3578., 17328., 10793., 10851.,
       10466.,  2362.,  6439.,  5769.,  4385.,  4066.,  5206.,  2655.,
        2570.,  4502.,  4968.,  5147.,  2718.,  3539.,  5468.,  5813.,
        9667.,  5154.,  5675.,  7314.,  5098., 13570.,  6712.,  9991.,
       10248., 10938.,  2593., 11878.,  8095., 16856.,  4537., 17924.,
        4014., 12742.,  3376., 10482.,  4249.,  6549., 14411., 19586.,
        8237.,  3211., 16704.,  4774.,  4568.,  5993.,  6499.,  3452.,
        6397.,  2725.,  3622.,  6180.,  6274.,  4381.,  2559.,  5488.,
        2514.,  3196.,  3420.,  4087.,  5368., 12936.,  4221.,  4963.,
        4200.,  5006.,  7639.,  6502., 13525.,  6349.,  6380.,  3102.,
        4556.,  4230.,  4859.,  6322., 10761.,  2973.,  5204., 17399.,
       16885.,  4323.,  5155.,  2936., 18789.,  4883.,  2029.,  2996.,
        9278.,  4162.,  8853.,  4876.,  2141.,  7756.,  3936.,  6842.,
        3989.,  4930.,  3702.,  2705.,  4448.,  2379.,  5487.,  2810.,
        8938.,  9936.,  5454., 18740.,  5473., 13503., 13549., 18172.,
        2774.,  9439.,  5265.,  3815.,  2389.,  4000., 17584.,  5661.,
        4869.,  4649., 10496.,  2768.,  3408.,  3755.,  2187.,  4258.,
        5326.,  5485.,  2782., 17639.,  6062.,  6288.,  3424.,  4194.,
        2532.,  5666., 13726.,  4107.,  3597.,  4115.,  6272.,  2517.,
        3904.,  9204.,  4373.,  2064.,  2430.,  4877.,  3760.,  2013.,
        2974.,  2766.,  3377.,  4213.,  6513.,  4284.,  2226.,  5561.,
        2144.,  5373.,  2897.,  5321.,  5410.,  4850.,  2001.,  4404.,
        3944.,  2960., 18947.,  6465.,  2683.,  2014.,  3441., 13664.,
        5021., 18844.,  4739., 10650.,  4317.,  2024.,  3058.,  3929.,
        4425.,  2328.,  2657.,  5940.,  2622.,  3212.,  2911.,  6931.,
        2176.,  3230., 18665.,  2789.,  6410.,  4941.,  3983.,  2904.,
        2696.,  2174.,  6755., 10965.,  2543., 19406.,  6538.,  2258.,
        2218.,  2654., 11935.,  2546.,  3894.,  4262., 10527.,  2400.,
        3681.,  3447., 19513.,  2659.,  8847.,  2045.,  4851.,  8120.,
        4577.,  5405.,  3708., 13770.,  2297.,  2450.,  4342.,  2572.,
        6500.,  3149.,  5324.,  4382.,  2553.,  5933.,  4403., 10934.,
        2022.,  4256.,  3580.,  2899.,  5562.,  2377.,  2404.,  2799.,
        2811.,  4377.,  4240.,  4227.,  3917.,  4969.,  2042.,  2821.,
        9957.,  2207.,  2070.,  2791.,  8224.,  2610.,  5731.,  2539.,
        2376., 19081.,  2743.,  4538.,  3867.,  2080.,  2096.,  4627.,
        2302.,  5071., 10596.,  5467.,  2394.,  3629.,  9362.,  3229.,
       16422.,  5647.,  4400.,  2066.,  5486.,  3162.,  6651.,  4898.,
        3180., 11244.,  4069.,  6392.,  4855.,  3312.,  3117., 15202.,
        2580.,  2166.,  4374.,  5505.,  2587., 15972.,  2305.,  3433.,
        3477.,  3907.,  3445.,  2760.,  6294., 13116.,  3591.,  2105.,
        3902.,  2662.,  2062.,  5507.,  8103.,  3978.,  5399., 10448.,
        4440.,  2660.,  3375.,  2269.,  4787.,  2809., 10854.,  2571.,
        6142.,  2496.,  3419.,  2501.,  2566.,  3920., 13964.,  6540.,
        2244., 16184.,  4233., 14814., 17159.,  2318.,  3617.,  2684.,
       19237.,  4422.,  2552.,  2678.,  5171., 11916.,  9380.,  5878.,
        2468.,  4127.,  2148.,  3886.,  6667.,  2090.,  2086.,  1951.,
        3022.,  9724.,  3388.,  3038.,  2322.,  2926.,  4505.,  2835.,
        6553.,  6673., 13591.,  2177., 19517., 19202., 10048.,  2723.,
        6644.,  3161.,  1420.,  1200.,  5238.,  9985., 15992.,  2370.,
        6781.,  6653.,  2851.,  5258.,  2476.,  2285.,  3448.,  4558.,
        1702.,  2564.,  5070.,  3780.,  9824.,  1878.,  2340.,  2127.,
        2033.,  9602., 16627.,  2083.,  1009.,  7861.,  2642.,  5121.,
        2694.,  5094.,  2274.,  2314.,  2380.,  2008., 10552.,  2259.,
        2413.,  2121.,  2479., 13194.,  4163.,  2600., 18303.,  4777.,
        1052.,  2461.,  2596.,  4728.,  7351.,  4766.,  2827.,  2853.,
        2290.,  2107.,  2210., 13191., 18265.,  1118.,  2372.,  2838.,
       18061.,  1611.,  4768.,  1274.,  2561.,  1563.,  6388.,  8376.,
        4841.,  2074.,  2972.,  6815.,  2690., 17567.,  1569.,  4187.,
        3306.,  1393., 10883.,  2862.,  6735.,  9756.,  5294.,  2437.,
        4071.,  2956.,  4648.,  2804.,  2439.,  2856.,  2933.,  1091.,
        5151.,  2863.,  2858.,  1129., 19431.])

-------

`Es str, creo que no requiere cambios es una fecha de a√±o por si sola`‚úÖ

In [100]:
df["datebirth"].unique()

array([1972, 1971, 1981, 1976, 1977, 1975, 1964, 1982, 1967, 1985, 1968,
       1983, 1965, 1988, 1978, 1990, 1987, 1989, 1970, 1980, 1963, 1991,
       1986, 1974, 1984, 1973, 1979, 1993, 1994, 1992, 1969, 1966, 1996,
       1995, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005])

-------

Eliminado ‚ùå

In [ ]:
df["salary"].unique()

-------

Eliminado ‚ùå

In [ ]:
df['roledepartament'].unique()

------

Eliminado ‚ùå

In [ ]:
df["numberchildren"].unique()

-------


`Modificamos los valores 0 y 1, True or False por Yes y No` ‚úÖ
- 1  =      360
- True  =   345
- 0   =     309
- False =   305
- Yes  =    295

In [101]:
df['remotework']= df['remotework'].replace({('1'):'Yes',('0') or ('False'): 'No', 'True': 'Yes', 'False': 'No'})

In [105]:
df["remotework"].unique()

array(['Yes', 'No'], dtype=object)

In [106]:
df['remotework'].value_counts()

remotework
Yes    1000
No      614
Name: count, dtype: int64

-------

In [107]:
# Guarda el DataFrame como un archivo CSV
df.to_csv("df_Casi_Limpio.csv", index = False)